import { FC } from 'react';
import Container from '../../../../components/Container/Container';
import { Box, Divider, List, Space, Text } from '@mantine/core';
import CustomDivider from '../../../../components/CustomDivider/CustomDivider';

const AboutUsInfo: FC = () => {
  return (
    <Container>
      <Text fz={28} fw={700} ta="center">
        Про нас
      </Text>
      <CustomDivider mb={48}/>
      <Text fz={16} fw={400}>
        Ласкаво запрошуємо до нашого інноваційного проекту, який перевертає уявлення про взаємодію між студентами та
        адміністрацією! Ми - команда талановитих студентів, які об'єднали зусилля, щоб створити веб-додаток, який
        спростить ваш студентський досвід та зробить комунікацію з університетською адміністрацією максимально
        ефективною.
        <Space h="lg" />
        <Text fw={600} inherit>
          Наша місія
        </Text>
        Наша місія полягає в розв'язанні двох важливих проблем сучасного навчання: упорядкування потоку запитань від
        студентів та забезпечення того, що жоден запит не залишиться без відповіді. Наша платформа дозволяє вам легко
        надсилати запити, заповнюючи стандартні поля, і отримувати швидку та інформативну відповідь від адміністрації.
        <Space h="lg" />
        <Text fw={600} inherit>
          Як це працює
        </Text>
        Кожен ваш запит отримує унікальний ідентифікаційний номер, що гарантує, що він не буде загублений в потоці інших
        листів. Після відправлення вашого запиту, він автоматично розподіляється між нашими досвідченими
        адміністраторами, які мають визначені напрямки. Ви можете відстежувати статус свого запиту через систему та
        легко спілкуватися з адміністраторами, використовуючи унікальний ідентифікаційний номер.
        <Space h="lg" />
        <Text fw={600} inherit>
          Наша команда
        </Text>
        Наша команда складається зі студентів, майбутніх фахівців з області розробки, дизайну та адміністрування. Кожен
        з нас приносить унікальний внесок у розробку цього проекту, і ми горді представити вам наші ролі та вміння:
        <List type="unordered">
          <List.Item>
            Frontend Developers: Ми створюємо інтуїтивно зрозумілі та естетичні інтерфейси для взаємодії з нашим
            веб-додатком, роблячи його зручним та привабливим для вас.
          </List.Item>
          <List.Item>
            Backend Developer: Ми розробляємо та підтримуємо технічний аспект системи, гарантуючи швидку та ефективну
            обробку запитів.
          </List.Item>
          <List.Item>
            Дизайнери: Ми відповідаємо за вигляд та відчуття нашого веб-додатка. Наша мета - зробити користування
            платформою не лише функціональним, але й приємним для очей.
          </List.Item>
        </List>
        <Space h="lg" />
        <Text fw={600} inherit>
          Наші технічна база
        </Text>
        Наші технічна база включає передові технології, такі як Java, JavaScript та ReactJS та багато інших, щоб
        забезпечити стабільність та зручність користування. Наші бази даних зберігають ваші дані безпечно та ефективно.
        Ми використовуємо GitHub для контролю версій та трекінгу завдань.
      </Text>
    </Container>
  );
};

export default AboutUsInfo;
