import { FC } from "react";
import { Button, Modal, Stack, Text } from "@mantine/core";
import Link from "next/link";


interface ConfirmModalProps {
    opened: boolean;
    close: () => void;
    onConfirm?: () => void;
}

const ConfirmModal: FC<ConfirmModalProps> = ({ opened, close }) => {
    return (
        <Modal
            opened={opened}
            onClose={close}
            withCloseButton={false}
            styles={{
                content: {
                    minWidth: "930px",
                    padding: "64px"
                }
            }}
        >
            <Stack gap={24}>
                <Text fz={20} fw={700}>Увага до обраного напряму!</Text>
                <Text>
                    До підсумкової семестрової рейтингової оцінки студента можуть бути додані додаткові бали,
                    які призначаються стипендіальною комісією інституту з урахуванням досягнень протягом семестру,
                    за результатами якого призначається стипендія. Для підрахунку суми додаткових балів,
                    що враховуються у стипендіальному рейтингу, використовується перелік основних досягнень,
                    з яким можна ознайомитись у &nbsp;
                    <Link style={{textDecoration: "underline", color: "inherit"}} target="_blank" href="https://www.kpi.kharkov.ua/ukr/wp-content/uploads/sites/2/2019/02/Poryadok-formuvannya-stypend-rejtyng-yyul-2019.pdf">
                        ПОРЯДКУ формування стипендіального рейтингу студентів НТУ «ХПІ» для призначення академічних стипендій
                    </Link>, стор. 7-10.
                </Text>
                <Text>
                    Для призначення додаткових балів за участь у науковій та науково-технічній діяльності,
                    громадському житті, творчій та спортивній діяльності до стипендіальної комісії інституту
                    в термін не пізніше 3-х днів після закінчення сесії подається заява від студента,
                    візована відповідальними особами (як правило, керівниками структурних підрозділів університету),
                    що гарантують відповідність дійсності такої заяви та додається копія підтверджуючого документу,
                    якщо мається (грамоти, дипломи, звіти, тощо). Такими відповідальними особами можуть бути:
                    з навчально-наукової роботи – завідувачі відповідних кафедр; з суспільно-корисної роботи
                    – директор Палацу студентів (щодо художньої самодіяльності та культурно-масових заходів),
                    голова студентського самоврядування, голова студентського профкому, голови студентських рад гуртожитків,
                    заступники декана; зі спортивної діяльності – завідувач кафедри Фізичного виховання та спорту.
                </Text>
                <Text>
                    <Link style={{textDecoration: "underline", color: "inherit"}} target="_blank" href="https://www.kpi.kharkov.ua/ukr/wp-content/uploads/sites/2/2018/08/Forma-zavy.pdf">
                        Бланк заяви на призначення додаткових балів до стипендіального рейтингу
                    </Link>
                </Text>
                <Text>
                    Заява оформлюється студентом особисто від руки на відповідному бланці заяви
                </Text>
                <Button onClick={close} h={48} w={"100%"} radius="xl" color="#02808F">
                    Зрозуміло
                </Button>
            </Stack>
        </Modal>
    )
} 

export default ConfirmModal;